OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f8622.h
/*
 * This declarations of the PIC18F8622 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:52 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F8622_H__
#define __PIC18F8622_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        SSP2CON2 Bits

extern __at(0x0F62) __sfr SSP2CON2;

typedef union
  {
  struct
    {
    unsigned SEN                : 1;
    unsigned RSEN               : 1;
    unsigned PEN                : 1;
    unsigned RCEN               : 1;
    unsigned ACKEN              : 1;
    unsigned ACKDT              : 1;
    unsigned ACKSTAT            : 1;
    unsigned GCEN               : 1;
    };

  struct
    {
    unsigned SEN2               : 1;
    unsigned RSEN2              : 1;
    unsigned PEN2               : 1;
    unsigned RCEN2              : 1;
    unsigned ACKEN2             : 1;
    unsigned ACKDT2             : 1;
    unsigned ACKSTAT2           : 1;
    unsigned GCEN2              : 1;
    };
  } __SSP2CON2bits_t;

extern __at(0x0F62) volatile __SSP2CON2bits_t SSP2CON2bits;

#define _SSP2CON2_SEN           0x01
#define _SSP2CON2_SEN2          0x01
#define _SSP2CON2_RSEN          0x02
#define _SSP2CON2_RSEN2         0x02
#define _SSP2CON2_PEN           0x04
#define _SSP2CON2_PEN2          0x04
#define _SSP2CON2_RCEN          0x08
#define _SSP2CON2_RCEN2         0x08
#define _SSP2CON2_ACKEN         0x10
#define _SSP2CON2_ACKEN2        0x10
#define _SSP2CON2_ACKDT         0x20
#define _SSP2CON2_ACKDT2        0x20
#define _SSP2CON2_ACKSTAT       0x40
#define _SSP2CON2_ACKSTAT2      0x40
#define _SSP2CON2_GCEN          0x80
#define _SSP2CON2_GCEN2         0x80

//==============================================================================


//==============================================================================
//        SSP2CON1 Bits

extern __at(0x0F63) __sfr SSP2CON1;

typedef union
  {
  struct
    {
    unsigned SSPM0              : 1;
    unsigned SSPM1              : 1;
    unsigned SSPM2              : 1;
    unsigned SSPM3              : 1;
    unsigned CKP                : 1;
    unsigned SSPEN              : 1;
    unsigned SSPOV              : 1;
    unsigned WCOL               : 1;
    };

  struct
    {
    unsigned SSPM02             : 1;
    unsigned SSPM12             : 1;
    unsigned SSPM22             : 1;
    unsigned SSPM32             : 1;
    unsigned CKP2               : 1;
    unsigned SSPEN2             : 1;
    unsigned SSPOV2             : 1;
    unsigned WCOL2              : 1;
    };
  } __SSP2CON1bits_t;

extern __at(0x0F63) volatile __SSP2CON1bits_t SSP2CON1bits;

#define _SSP2CON1_SSPM0         0x01
#define _SSP2CON1_SSPM02        0x01
#define _SSP2CON1_SSPM1         0x02
#define _SSP2CON1_SSPM12        0x02
#define _SSP2CON1_SSPM2         0x04
#define _SSP2CON1_SSPM22        0x04
#define _SSP2CON1_SSPM3         0x08
#define _SSP2CON1_SSPM32        0x08
#define _SSP2CON1_CKP           0x10
#define _SSP2CON1_CKP2          0x10
#define _SSP2CON1_SSPEN         0x20
#define _SSP2CON1_SSPEN2        0x20
#define _SSP2CON1_SSPOV         0x40
#define _SSP2CON1_SSPOV2        0x40
#define _SSP2CON1_WCOL          0x80
#define _SSP2CON1_WCOL2         0x80

//==============================================================================


//==============================================================================
//        SSP2STAT Bits

extern __at(0x0F64) __sfr SSP2STAT;

typedef union
  {
  struct
    {
    unsigned BF                 : 1;
    unsigned UA                 : 1;
    unsigned R_NOT_W            : 1;
    unsigned S                  : 1;
    unsigned P                  : 1;
    unsigned D_NOT_A            : 1;
    unsigned CKE                : 1;
    unsigned SMP                : 1;
    };

  struct
    {
    unsigned BF2                : 1;
    unsigned UA2                : 1;
    unsigned R_W                : 1;
    unsigned I2C_START          : 1;
    unsigned I2C_STOP           : 1;
    unsigned D_A                : 1;
    unsigned CKE2               : 1;
    unsigned SMP2               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned I2C_READ           : 1;
    unsigned START2             : 1;
    unsigned STOP2              : 1;
    unsigned I2C_DAT            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_W              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_A              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_WRITE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned NOT_ADDRESS        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned READ_WRITE         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DATA_ADDRESS       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned R                  : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned D                  : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RW2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DA2                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __SSP2STATbits_t;

extern __at(0x0F64) volatile __SSP2STATbits_t SSP2STATbits;

#define _SSP2STAT_BF            0x01
#define _SSP2STAT_BF2           0x01
#define _SSP2STAT_UA            0x02
#define _SSP2STAT_UA2           0x02
#define _SSP2STAT_R_NOT_W       0x04
#define _SSP2STAT_R_W           0x04
#define _SSP2STAT_I2C_READ      0x04
#define _SSP2STAT_NOT_W         0x04
#define _SSP2STAT_NOT_WRITE     0x04
#define _SSP2STAT_READ_WRITE    0x04
#define _SSP2STAT_R             0x04
#define _SSP2STAT_RW2           0x04
#define _SSP2STAT_S             0x08
#define _SSP2STAT_I2C_START     0x08
#define _SSP2STAT_START2        0x08
#define _SSP2STAT_P             0x10
#define _SSP2STAT_I2C_STOP      0x10
#define _SSP2STAT_STOP2         0x10
#define _SSP2STAT_D_NOT_A       0x20
#define _SSP2STAT_D_A           0x20
#define _SSP2STAT_I2C_DAT       0x20
#define _SSP2STAT_NOT_A         0x20
#define _SSP2STAT_NOT_ADDRESS   0x20
#define _SSP2STAT_DATA_ADDRESS  0x20
#define _SSP2STAT_D             0x20
#define _SSP2STAT_DA2           0x20
#define _SSP2STAT_CKE           0x40
#define _SSP2STAT_CKE2          0x40
#define _SSP2STAT_SMP           0x80
#define _SSP2STAT_SMP2          0x80

//==============================================================================

extern __at(0x0F65) __sfr SSP2ADD;
extern __at(0x0F66) __sfr SSP2BUF;

//==============================================================================
//        ECCP2DEL Bits

extern __at(0x0F67) __sfr ECCP2DEL;

typedef union
  {
  struct
    {
    unsigned P2DC0              : 1;
    unsigned P2DC1              : 1;
    unsigned P2DC2              : 1;
    unsigned P2DC3              : 1;
    unsigned P2DC4              : 1;
    unsigned P2DC5              : 1;
    unsigned P2DC6              : 1;
    unsigned P2RSEN             : 1;
    };

  struct
    {
    unsigned PDC0               : 1;
    unsigned PDC1               : 1;
    unsigned PDC2               : 1;
    unsigned PDC3               : 1;
    unsigned PDC4               : 1;
    unsigned PDC5               : 1;
    unsigned PDC6               : 1;
    unsigned PRSEN              : 1;
    };

  struct
    {
    unsigned PDC                : 7;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2DC               : 7;
    unsigned                    : 1;
    };
  } __ECCP2DELbits_t;

